
&НаКлиенте
Процедура IDОбращенияПриИзменении(Элемент)
	Обращение = Объект.IDОбращения;
	Объект.IDГражданина = ПолучитьИнформацию(Обращение);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Объект.Дата = ТекущаяДата();  
	Обращение = Объект.IDОбращения.ПолучитьОбъект();
	
	Если Объект.Решение = Перечисления.ВидыРешения.Одобрено Тогда
		Обращение.СтатусОбращения = Перечисления.СтатусыОбращения.Одобрено;
	ИначеЕсли Объект.Решение = Перечисления.ВидыРешения.Отказано Тогда
		Обращение.СтатусОбращения = Перечисления.СтатусыОбращения.Отказано;
	ИначеЕсли Объект.Решение = Перечисления.ВидыРешения.ЧастичноУдовлетворено Тогда
        Обращение.СтатусОбращения = Перечисления.СтатусыОбращения.Одобрено;
	КонецЕсли;  

	Обращение.Записать();
КонецПроцедуры    

Функция ПолучитьИнформацию(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбращениеЗаПомощью.IDГражданина КАК IDГражданина
	|ИЗ
	|	Документ.ОбращениеЗаПомощью КАК ОбращениеЗаПомощью
	|ГДЕ
	|	ОбращениеЗаПомощью.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.IDГражданина;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура Файлы(Команда)    
	IDГражданина = Объект.IDГражданина;
	Форма = ПолучитьФорму("Справочник.ФайлыГраждан.Форма.ФормаЭлемента");    
	Форма.Объект.Владелец = IDГражданина;
	Форма.Открыть();
КонецПроцедуры
