
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Объект.Дата = ТекущаяДата();
	НачатьТранзакцию();	
	Если НЕ Объект.ВнесенВБД Тогда    
	Объект.ВнесенВБД = Истина;  
	
	Запись = Справочники.Граждане.СоздатьЭлемент();
	
	Запись.КатегорияГражданина = Перечисления.КатегорииГраждан.Неизвестный;
	Запись.СоциальныйСтатус = Перечисления.СоцСтатусы.Неизвестный;
	Запись.ТекущийСтатусНуждаемости = Перечисления.СтатусыНуждаемости.Неизвестный;
	
	Запись.Код = Объект.IDГражданина;  
	Запись.Наименование = Объект.ФИО;
    Запись.ДатаРождения = Объект.ДатаРождения;
	Запись.СерияИНомер = Объект.СерияИНомер;
	Запись.ДатаВыдачи = Объект.ДатаВыдачи;
	Запись.КемВыдан = Объект.КемВыдан;
	Запись.КодПодразделения = Объект.КодПодразделения;
	Запись.ФактическийАдрес = Объект.ФактическийАдрес;
	Запись.НомерТелефона = Объект.НомерТелефона;
	Запись.EMail = Объект.EMail;
	Запись.КатегорияГражданина = Объект.КатегорияГражданина;
	Запись.СоциальныйСтатус = Объект.СоциальныйСтатус;  
	Запись.ДатаРегистрации = Объект.Дата;
	
	Запись.Записать();      
	
	   
	КонецЕсли;
ЗафиксироватьТранзакцию();	
КонецПроцедуры          

&НаКлиенте
Процедура Файлы(Команда)    
	СсылкаГражданина = ПолучитьИнформацию(Объект.ФИО, Объект.СерияИНомер); 
	Если Объект.Ссылка.Пустая() Тогда 
		Предупреждение("Проведите документ перед прикреплением файла.");
	Иначе
		Форма = ПолучитьФорму("Справочник.ФайлыГраждан.Форма.ФормаЭлемента");    
		Форма.Объект.Владелец = СсылкаГражданина;  
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры    

Функция ПолучитьИнформацию(ФИО, СерияИНомер)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Граждане.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Граждане КАК Граждане
	|ГДЕ
	|	Граждане.Наименование = &Наименование
	|	И Граждане.СерияИНомер = &СерияИНомер";
	
	Запрос.УстановитьПараметр("Наименование", ФИО); 
	Запрос.УстановитьПараметр("СерияИНомер", СерияИНомер); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
КонецФункции

