
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НазначениеПомощи") Тогда
		// Заполнение шапки
		IDГражданина = ДанныеЗаполнения.IDГражданина;
		IDНазначения = ДанныеЗаполнения.Ссылка;
		ТипВыданнойПомощи = ДанныеЗаполнения.ТипПомощи;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
