
&НаКлиенте
Процедура IDНазначенияПриИзменении(Элемент)
	Назначение = Объект.IDНазначения;
	Объект.IDГражданина = ПолучитьИнформацию(Назначение);
    Объект.ТипВыданнойПомощи = ПолучитьИнформациюДоп(Назначение)
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Объект.Дата = ТекущаяДата();
КонецПроцедуры

Функция ПолучитьИнформацию(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НазначениеПомощи.IDГражданина КАК IDГражданина
	|ИЗ
	|	Документ.НазначениеПомощи КАК НазначениеПомощи
	|ГДЕ
	|	НазначениеПомощи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.IDГражданина;
	КонецЦикла;
КонецФункции      

Функция ПолучитьИнформациюДоп(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НазначениеПомощи.ТипПомощи КАК ТипВыданнойПомощи
	|ИЗ
	|	Документ.НазначениеПомощи КАК НазначениеПомощи
	|ГДЕ
	|	НазначениеПомощи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ТипВыданнойПомощи;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура Файлы(Команда)    
	IDГражданина = Объект.IDГражданина;
	Форма = ПолучитьФорму("Справочник.ФайлыГраждан.Форма.ФормаЭлемента");    
	Форма.Объект.Владелец = IDГражданина;
	Форма.Открыть();
КонецПроцедуры
