
&НаКлиенте
Процедура IDРассмотренияПриИзменении(Элемент)
	Рассмотрение = Объект.IDРассмотрения;
	Объект.IDГражданина = ПолучитьИнформацию(Рассмотрение);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Объект.Дата = ТекущаяДата();
КонецПроцедуры 

Функция ПолучитьИнформацию(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РассмотрениеОбращения.IDГражданина КАК IDГражданина
	|ИЗ
	|	Документ.РассмотрениеОбращения КАК РассмотрениеОбращения
	|ГДЕ
	|	РассмотрениеОбращения.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.IDГражданина;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура Файлы(Команда)    
	IDГражданина = Объект.IDГражданина;
	Форма = ПолучитьФорму("Справочник.ФайлыГраждан.Форма.ФормаЭлемента");    
	Форма.Объект.Владелец = IDГражданина;
	Форма.Открыть();
КонецПроцедуры
